[
  {
    "code": "AL",
    "country": "Albania",
    "dish": "Tave me Presh ska Mish + Qofte Mbushur ",
    "image": "/images/Albania.png",
    "cooked": "2025-06-28",
    "rating": 3,
    "recipe": [
  {
    "label": "www.myalbanianfood.com (Meatless Leek Bake)",
    "url": "https://www.myalbanianfood.com/recipe/albanian-tave-presh-meatless-leek-bake/"
  },
  {
    "label": "www.myalbanianfood.com (Stuffed Meatballs)",
    "url": "https://www.myalbanianfood.com/recipe/stuffed-meatballs/"
  }
],
    "review": [
     "Our first stop on the adventure, Albania. Was a combination of two dishes. The first was Tave me Presh ska Mish (Meatless Leek Bake) and the second was Qofte Mbushur (Stuffed Meatballs). I chose to add the meatballs as i did not think my wife would be impressed first meal being meatless, how wrong I was.",
     "Her thoughts surprising to me was the Rice was quite crunchy which felt wrong but worked well and the Leeks were yummy but thought it could use more. The Meatballs were nice but nothing too special and could'nt tell there was mozarella in them, with the sauce nice, but plain.",
     "I can't tend to disagree with her view, I feel much the same way but some factors need to be considered. Leek Bake I used one medium leek when recipe calls 250g so I would increase leeks next time. Meatballs I screwed up. I forgot the cooking time, prior to starting so rather than slow-cooked it was rushed which affected the dish. Quick cooking the meatballs in air fryer for 5 minutes before in sauce for only an hour on the hob didn't allow chance for the flavours to develop. Also instead Pasta Sauce I used tinned tomatoes and some herbs.",
     "Overall, I think the score of 3 is a bit harsh and more the execution than the recipe. The Leek bake was delicious, whilst I would be very keen to try the meatballs again giving them the time they need.",
     "Final note. The image is not a good picture or reflection as I wasn't thinking at the time this would be published forever, so trust the website pictures more."
  ]
  },
  {
    "code": "BT",
    "country": "Bhutan",
    "dish": "Ema Datshi",
    "image": "/images/Bhutan.jpeg",
    "cooked": "2025-07-05",
    "rating": 4,
    "recipe": [
  {
    "label": "marcsrecipes.com",
    "url": "https://marcsrecipes.com/ema-datshi/"
  }
]
,
    "review": [
    "The first curve ball was Bhutan being chosen(Thanks ChatGPT), was I going to be able to find anything to make with the ingredients being available. Then finding an interesting dish, the expectations were it could be excellent or a contingency plan for dinner was needed.(The fish and chips round the corner was calling)",
    "Whilst I was curious, my wife was not impressed and sceptical of ability to pull it off. To her surpise she was impressed with the presentation and how good it tasted. It was weird getting hits of melted cheese in what felt like a cross between curry and soup. It could have been spicier but was full of flavour and a pleasant surpise.",
    "I was a big fan of this dish, I thought the sweet and spicy blend was great, I too was pleasantly surprised. Surprisingly the issue I had from making it 5 stars was the heat. Part of the trepidition was it was going to be way too hot for me, but I felt it could have added a bit more heat to make it truly outstanding.",
    "Couple of changes I made which may have impacted the heat. We forgot tomatoes in shopping so we went with tinned tomatoes again (so left out the water) and as most of our chillis from the garden are in the freezer, the last few off the plants weren't quite enough so added some jalapenos and roasted red capsicum. Issues with ingredients was only the sichuan pepper, substituted for a chilli oil. Next time I would addd more of this and less oil. The other missing ingredient was red rice, so substituted with a microwave packet Brown,Red,Wild rice mix."
  ]
  },
{
    "code": "CO",
    "country": "Colombia",
    "dish": "Picadillo De Carne Y Chorizo",
    "image": "/images/Colombia.jpeg",
    "cooked": "2025-07-12",
    "rating": 3,
    "recipe": [
  {
    "label": "mycolombianrecipes.com",
    "url": "https://www.mycolombianrecipes.com/chorizo-and-beef-picadillo-picadillo-de-carne-y-chorizo/"
  }
]
,
    "review": [
    "When choosing a dish from Colombia, I went safe on the ingredients for this dish. I did attempt a side dish accompaniement which was a complete disaster and inedible, completly on me trying to substitute. I'll perhaps try that one again in the future.",
    "My wifes opinion of the dish this week was nice but not as different or exciting as previous weeks. She was a fan of the raisins and olives, but potato was hard and rice unneccesary. ",
    "My feelings were similar, I felt it lacked flavour, but both agreed leftovers when the flavour had more time to infuse was delicious.",
    "Not a terrible dish, and really enjoyable as leftovers for lunch. My only improvement would be the potatoes, I would suggest cutting smaller or par-boiling before, they did not cook well enough in the dish."
  ]
  },
  {
    "code": "DO",
    "country": "Dominica",
    "dish": "Callaloo Soup",
    "image": "/images/Dominica.jpeg",
    "cooked": "2025-07-19",
    "rating": 3,
    "recipe": [
  {
    "label": "dominicagourmet",
    "url": "https://dominicagourmet.com/dominican-callaloo-soup-recipe/"
  }
]
,
    "review": [
    "Not brave enough to try cooking Crab, this week I made quite a few alterations on the recipe.",
    "Well trepedatious at first, and presentation was dubious. The wife felt all in all this week the meal was yumm. Not a big fan of the dumplings, she thought fish instead would have been better. It was rich in flavour and the bacon salt added to the dish nicely, she would definitly try again.",
    "I feel 3 is harsh for this dish, due to all the alterations and I defintly would try again with fish. Once again leftovers were fantastic, and whilst the dumplings were plain they soaked up the liquid and flavours brilliantly.",
    "A suggestion as alternative for crab was smoked pork, which is why I went with smoked salty bacon, the main substitue was spinach instead of suggested greens. If making again I would use fish or get ambitious and use crab. This dish has a lot of potential and many uses to be adaptable. A big fan."
  ]
  }
]
